==================
String literals with operators
==================

LINE "3*(32-bit)"

---

(script
  (command_expression
    command: (identifier)
    arguments: (argument_list
      (string))))

==================
Path literals with operators
==================

DO ~~/demo/arm/hardware/zynq-7000/zc702/ps7_init.tcl "POST"
Data.LOAD.Elf &workspace/ultra96-vx7vip64/default/vxWorks

---

(script
  (command_expression
    command: (identifier)
    arguments: (argument_list
      (path)
      (string)))
  (command_expression
    command: (identifier)
    arguments: (argument_list
      (macro)
      (path))))

==================
Addresses with nested expressions
==================

&a = P:&HEAD
&a = EA:&HEAD+0x4

&b = NS:&nVmid:::0x0::0x0
&b = N:&mid:::0

---

(script
  (assignment_expression
    left: (macro)
    right: (address
      access: (access_class)
      location: (macro)))
  (assignment_expression
    left: (macro)
    right: (address
      access: (access_class)
      location: (binary_expression
        left: (macro)
        right: (integer))))
  (assignment_expression
    left: (macro)
    right: (address
      access: (access_class)
      (memory_space
        machine: (macro)
        space: (integer))
      location: (integer)))
  (assignment_expression
    left: (macro)
    right: (address
      access: (access_class)
      (memory_space
        machine: (macro))
      location: (integer))))

==================
Commands with multi-part names
==================

SYStem.CPU ZYNQ-7000
SYStem.CONFIG L2CACHE Type L2C-310

---

(script
  (command_expression
    command: (identifier)
    arguments: (argument_list
      (identifier)))
  (command_expression
    command: (identifier)
    arguments: (argument_list
      (identifier)
      (identifier)
      (identifier))))
