================================================================================
Single quote string - single word
================================================================================

'value'
'#'

--------------------------------------------------------------------------------

(program
  (command
    name: (single_quote_string))
  (command
    name: (single_quote_string)))

================================================================================
Single quote string - multi words
================================================================================

'value of the string is anything inbetween the quotes'

--------------------------------------------------------------------------------

(program
  (command
    name: (single_quote_string)))

================================================================================
Single quote string - escape sequences
================================================================================

'value of the string is anything between the quotes\
a string can span two lines'

--------------------------------------------------------------------------------

(program
  (command
    name: (single_quote_string
      (escape_sequence))))

================================================================================
Single quote string - escaped quotes
================================================================================

'string can have escaped single quotes in it: \''

--------------------------------------------------------------------------------

(program
  (command
    name: (single_quote_string
      (escape_sequence))))

================================================================================
Single quote string - double quotes with no meaning
================================================================================

'value "$PATH" is literal'

--------------------------------------------------------------------------------

(program
  (command
    name: (single_quote_string)))

================================================================================
Single quote string - no variable expansion
================================================================================

'$PATH'

--------------------------------------------------------------------------------

(program
  (command
    name: (single_quote_string)))
