===
identifier: relative
===
x = foo.bar.baz
---
(unison
    (term_declaration
        (term_definition
            (wordy_id)
            (kw_equals)
            (path)
            (wordy_id))))
===
identifier: simple
===
x = baz
---
(unison
    (term_declaration
        (term_definition
            (wordy_id)
            (kw_equals)
            (wordy_id))))
===
identifier: symop
===
x = 1 + 1
---
(unison
    (term_declaration
        (term_definition
            (wordy_id)
            (kw_equals)
            (function_application
                (nat)
                (operator)
                (nat)))))
===
[Identifier] operator with path
===
> 1 Nat.== 1
---
(unison (watch_expression (function_application (nat) (path) (operator) (nat))))
===
[Identifier] hash-qualified symboly id
===
x = >>=#foo
---
(unison 
        (term_declaration 
            (term_definition
                (wordy_id)
                (kw_equals)
                (operator) 
                (hash_qualifier (hash_prefix)))))
===
[Identifier] HQ built in
===
x = ##Text.take
---
(unison (term_declaration (term_definition (wordy_id) (kw_equals) (built_in_hash (path) (wordy_id)))))
===
[Identifier] HQ prefix
===
x = #2tWjVAuc7
---
(unison
    (term_declaration
        (term_definition
            (wordy_id)
            (kw_equals)
            (hash_qualifier (hash_prefix)))))
===
[Identifier] HQ prefix and cycle
===
x = #y9ycWkiC1.y9
---
(unison
    (term_declaration
        (term_definition
            (wordy_id)
            (kw_equals)
            (hash_qualifier (hash_prefix) (cyclic_index)))))
===
[Identifier] HQ prefix and cid
===
x = #cWkiC1x89#1
---
(unison 
    (term_declaration 
        (term_definition 
            (wordy_id) 
            (kw_equals)
            (hash_qualifier (hash_prefix) (hash_cid)))))
===
[Identifier] HQ prefix, cycle, and cid
===
x = #DCxrnCAPS.WD#0
---
(unison
        (term_declaration
            (term_definition
                (wordy_id)
                (kw_equals)
                (hash_qualifier (hash_prefix) (cyclic_index) (hash_cid)))))
